<script>
</script>

<p>
  60-30-10 часто используется в оформлении, чтобы получить сбалансированное
  сочетание цветов. | В нем говорится, что 60% пространства должно быть
  доминирующим цветом, | 30% — второстепенным цветом, а последние 10% —
  акцентом.
</p>
<p>60% — Доминирующий цвет (общий цвет поверхности, цвет фона).</p>
<p>
  30% — Вспомогательный цвет поверхности, поддерживает основной цвет, но должен
  достаточно отличаться.
</p>
<p>
  10% — Акцентный цвет. Он может быть более смелым или более тонким. 10% могут
  быть тем, что придает пространству характер или делает его более нейтральным.
</p>

<div style="display:flex; height:50px;border: 8px solid #f0f0f0;">
  <div style="background:var(--color-base); width:60%; float:left">60%</div>
  <div style="background:var(--color-supporting); width:30%; float:left">
    30%
  </div>
  <div style="background:var(--color-accent); width:10%; float:left">10%</div>
</div>

<p>
  Написать про отношения между тенями и светом (тени можно делать более
  насыщенными)
</p>
